In [30]:
# Instalação das bibliotecas
import pandas as pd
import numpy as np
import openpyxl

The read_csv() function in pandas allows us to easily our data. By default, it assumes the data is comma-delimited.
However, you can specify the delimiter used in your data (e.g., tab, semicolon, pipe, etc.). There are several parameters that you can specify. See the documentation here. https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html

In [19]:
# pandas can load CSV files as DataFrames - it pulls column labels from the first row of the data file
df2 = pd.read_csv(r'C:\Users\user\Documents\cities.csv')
df2

            City       State
0  san francisco  california
1        phoenix     arizona
2         seatle  washington
3         dallas       texas
4         denver    colorado
5        chicago    illinois
6       portland      oregon
7          miami     florida

In [20]:
# you can view the first few or the last few rows of DataFrame with the .head() or .tail() methods
df2.head()

            City       State
0  san francisco  california
1        phoenix     arizona
2         seatle  washington
3         dallas       texas
4         denver    colorado

In [21]:
# returns 5 rows by default, or you can pass the number of rows you want as an argument
df2.tail(3)

       City     State
5   chicago  illinois
6  portland    oregon
7     miami   florida

In [22]:
df2

            City       State
0  san francisco  california
1        phoenix     arizona
2         seatle  washington
3         dallas       texas
4         denver    colorado
5        chicago    illinois
6       portland      oregon
7          miami     florida

In [23]:
# you can add a new column to a DataFrame
df2['country'] = ''
df2

            City       State country
0  san francisco  california
1        phoenix     arizona
2         seatle  washington
3         dallas       texas
4         denver    colorado
5        chicago    illinois
6       portland      oregon
7          miami     florida

In [24]:
df2[2:5]

     City       State country
2  seatle  washington
3  dallas       texas
4  denver    colorado

In [37]:
# you can add a new row to a DataFrame
df3 = pd.concat([df2, pd.Series(name='index_name')], ignore_index=True)
df3
# df.append(pd.Series(name='index_name'))

            City       State country    0
0  san francisco  california          NaN
1        phoenix     arizona          NaN
2         seatle  washington          NaN
3         dallas       texas          NaN
4         denver    colorado          NaN
5        chicago    illinois          NaN
6       portland      oregon          NaN
7          miami     florida          NaN

In [40]:
df2

            City       State country
0  san francisco  california
1        phoenix     arizona
2         seatle  washington
3         dallas       texas
4         denver    colorado
5        chicago    illinois
6       portland      oregon
7          miami     florida

In [41]:
# you can update the values of an entire column
df2['country'] = 'USA'
df2

            City       State country
0  san francisco  california     USA
1        phoenix     arizona     USA
2         seatle  washington     USA
3         dallas       texas     USA
4         denver    colorado     USA
5        chicago    illinois     USA
6       portland      oregon     USA
7          miami     florida     USA

In [46]:
# you can set the values of a column (aka, Series) in the DataFrame list of values
df2['country'] = ['USA', 'United States'] * 4
df2

            City       State        country
0  san francisco  california            USA
1        phoenix     arizona  United States
2         seatle  washington            USA
3         dallas       texas  United States
4         denver    colorado            USA
5        chicago    illinois  United States
6       portland      oregon            USA
7          miami     florida  United States

In [48]:
# you can use fast vecctorized methods on a pandas series(aka, a column in our dataFrame)
df2['country'].str.replace('United States', 'USA')

0    USA
1    USA
2    USA
3    USA
4    USA
5    USA
6    USA
7    USA
Name: country, dtype: object

In [49]:
# that didn't do anything to our dataFrame because .str.replace() returns the updated version - it doesn't work
df2

            City       State        country
0  san francisco  california            USA
1        phoenix     arizona  United States
2         seatle  washington            USA
3         dallas       texas  United States
4         denver    colorado            USA
5        chicago    illinois  United States
6       portland      oregon            USA
7          miami     florida  United States

In [50]:
# we need to capture the updated values when they get returned
df2['country'] = df2['country'].str.replace('United States', 'USA')
df2

            City       State country
0  san francisco  california     USA
1        phoenix     arizona     USA
2         seatle  washington     USA
3         dallas       texas     USA
4         denver    colorado     USA
5        chicago    illinois     USA
6       portland      oregon     USA
7          miami     florida     USA

In [51]:
# you can change the columns names
df2.columns = ['city_name', 'state_name', 'nation']
df2

       city_name  state_name nation
0  san francisco  california    USA
1        phoenix     arizona    USA
2         seatle  washington    USA
3         dallas       texas    USA
4         denver    colorado    USA
5        chicago    illinois    USA
6       portland      oregon    USA
7          miami     florida    USA

In [54]:
# you can save your DataFrame as a CSV file
df2.to_csv(r'C:\Users\user\Documents\cities_new.csv') # ass your system path

# Dropping and editing values

In [55]:
#there are lots of ways to create dataFrames
list_of_tuples = [('sf', 2012), ( 'phx', np.nan), ('phx', 2005), ('chi', 2009)]
df = pd.DataFrame(list_of_tuples, columns=['city', 'year'])
df['country'] = 'USA'
df['continent'] = 'North America'
df

  city    year country      continent
0   sf  2012.0     USA  North America
1  phx     NaN     USA  North America
2  phx  2005.0     USA  North America
3  chi  2009.0     USA  North America